# Taps
tap "heroku/brew"

# Binaries
brew "carthage"
brew "heroku"
brew "mas"
brew "pandoc"
brew "swiftformat"
brew "tree"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

# Apps
cask "alfred"
cask "appcleaner"
cask "docker"
cask "discord"
cask "fastlane"
cask "fork"
cask "forklift"
cask "firefox"
cask "google-backup-and-sync"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "java"
cask "jetbrains-toolbox"
cask "logitech-presentation"
cask "mactex"
cask "nextcloud"
cask "omnifocus"
cask "postman"
cask "parallels"
cask "pdf-expert"
cask "sketch"
cask "slack"
cask "slite"
cask "sip"
cask "spotify"
cask "texpad"
cask "tunnelbear"
cask "visual-studio-code"
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "qlvideo"
cask "provisionql"
cask "wwdc"
cask "zotero"

# App Store
mas "1Blocker", id: 1107421413
mas "1Password", id: 1333542190
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Bear", id: 1091189122
mas "ChatMate for WhatsApp", id: 1228059008
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "HP Easy Scan", id: 967004861
mas "iStat Menus", id: 1319778037
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Motion", id: 434290957
mas "Notability", id: 736189492
mas "Numbers", id: 409203825
mas "Paste", id: 967805235
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Telegram", id: 747648890
mas "TogglDesktop", id: 957734279
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835

# Binaries  
brew "swiftlint" # requires Xcode
