# Taps
tap "homebrew/cask-drivers"
tap "possatti/possatti"

# Binaries

## Utilities
brew "gh"
brew "imagemagick"
brew "mas"
brew "pandoc"
brew "pokemonsay"
brew "pygments"
brew "tree"
brew "watch"
brew "youtube-dl"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

## Version Management
brew "asdf"

## Cloud Computing
brew "awscli"
brew "azure-cli"
brew "firebase-cli"
brew "terraform"

## iOS Development
brew "carthage"
brew "cocoapods"

# Python Development
brew "poetry"

## Kubernetes
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "kube-ps1"
brew "minikube"

## Other languages
cask "dotnet"
brew "go"

# Apps
cask "aerial"
cask "alt-tab"
cask "anki"
cask "appcleaner"
cask "around"
cask "brave-browser"
cask "cleanshot"
cask "discord"
cask "docker"
cask "figma"
cask "forklift"
cask "iina"
cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keyboard-maestro"
cask "lens"
cask "logitech-options"
cask "logitech-presentation"
cask "mactex-no-gui"
cask "marked"
cask "microsoft-teams"
cask "miro"
cask "monitorcontrol"
cask "notion"
cask "obsidian"
cask "pdf-expert"
cask "philips-hue-sync"
cask "raycast"
cask "rocket"
cask "rocket-typist"
cask "sf-symbols"
cask "sip"
cask "spotify"
cask "tableplus"
cask "texpad"
cask "tower"
cask "transmit"
cask "tunnelbear"
cask "visual-studio-code"
cask "wwdc"
cask "zoom"
cask "zotero"

# App Store
mas "1Blocker", id: 1107421413
mas "1Password", id: 1333542190
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Affinity Publisher", id: 881418622
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "ChatMate for WhatsApp", id: 1228059008
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "GoodNotes 5 ", id: 1444383602
mas "HP Easy Scan", id: 967004861
mas "Highlights - Extract PDF Notes", id: 1498912833
mas "Irvue", id: 1039633667
mas "Jira Cloud by Atlassian", id: 1475897096
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Reeder 5.", id: 1529448980
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Telegram", id: 747648890
mas "TickTick", id: 966085870
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
