# Taps
tap "homebrew/cask-drivers"
tap "possatti/possatti"

# Binaries

## Utilities
brew "gh"
brew "imagemagick"
brew "mas"
brew "pandoc"
brew "pokemonsay"
brew "pygments"
brew "tree"
brew "watch"
brew "youtube-dl"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

## Version Management
brew "jenv"
brew "nvm"
brew "pyenv"
brew "rbenv"

## Cloud Computing
brew "awscli"
brew "azure-cli"
brew "firebase-cli"
brew "terraform"

## iOS Development
brew "carthage"
brew "cocoapods"
brew "cocoapods"
brew "fastlane"
brew "swiftformat"

# Python Development
cask "anaconda"
brew "pipx"

## Kubernetes
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "minikube"

## Other languages
cask "dotnet"
brew "go"
brew "scala"

# Apps
cask "adoptopenjdk"
cask "aerial"
cask "alfred"
cask "appcleaner"
cask "batteries"
cask "brave-browser"
cask "cheatsheet"
cask "cleanshot"
cask "discord"
cask "docker"
cask "figma"
cask "fluor"
cask "forklift"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keyboard-maestro"
cask "logitech-options"
cask "logitech-presentation"
cask "lunar"
cask "mactex"
cask "marked"
cask "microsoft-teams"
cask "monitorcontrol"
cask "notion"
cask "pdf-expert"
cask "pdf-squeezer"
cask "philips-hue-sync"
cask "postman"
cask "qladdict"
cask "qlvideo"
cask "quicklook-json"
cask "sip"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "suspicious-package"
cask "syntax-highlight"
cask "tableplus"
cask "texpad"
cask "tower"
cask "tunnelbear"
cask "visual-studio-code"
cask "wwdc"
cask "zoomus"
cask "zotero"

# App Store
mas "1Blocker", id: 1107421413
mas "1Password", id: 1333542190
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Affinity Publisher", id: 881418622
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "ChatMate for WhatsApp", id: 1228059008
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "GoodNotes 5 ", id: 1444383602
mas "HP Easy Scan", id: 967004861
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Magnet", id: 441258766
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "Pocket", id: 568494494
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Telegram", id: 747648890
mas "TickTick: Things & Tasks To Do", id: 966085870
mas "TogglDesktop", id: 957734279
mas "Trello", id: 1278508951
mas "Xcode", id: 497799835
mas "iStat Menus", id: 1319778037

# Binaries  
brew "swiftlint" # requires Xcode
